<br>
<br>
<br>

# Handling Date And Time: 

<br>
<br>
<br>

In [68]:
import datetime
import numpy as np 
import pandas as pd

In [69]:
df_message = pd.read_csv("dataset/messages.csv")
df_order = pd.read_csv("dataset/orders.csv")

print(df_message.sample(2))

print()

print(df_order.sample(2))

print()

                    date                              msg
593  2015-01-31 00:40:00      п.поцелую девушке0934514694
38   2013-10-26 00:12:00  сделаю инт массаж М за 40 Света

           date  product_id  city_id  orders
263  2019-11-03        6694       25       2
587  2019-10-30        6153       22       6

<br>
<br>

# Working with Date: 

<br>
<br>

In [70]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [71]:

df_order["date"] = pd.to_datetime(df_order["date"])

df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [72]:

# extract year:

df_order["date"].dt.year

0      2019
1      2018
2      2018
3      2019
4      2019
       ...
995    2018
996    2018
997    2019
998    2019
999    2019
Name: date, Length: 1000, dtype: int32

In [73]:
# extract month :

df_order["date"].dt.month

0      12
1       8
2      10
3       8
4       1
       ..
995    10
996    12
997     5
998     3
999    10
Name: date, Length: 1000, dtype: int32

In [74]:

# extract month name:

df_order["date"].dt.month_name()

0      December
1        August
2       October
3        August
4       January
         ...
995     October
996    December
997         May
998       March
999     October
Name: date, Length: 1000, dtype: object

In [75]:

# extract day:

df_order["date"].dt.day

0      10
1      15
2      23
3      17
4       6
       ..
995     8
996     6
997     7
998     3
999    15
Name: date, Length: 1000, dtype: int32

In [76]:

# extract day_name: 
df_order["day_name"] = df_order["date"].dt.day_name()
df_order.sample(5)

          date  product_id  city_id  orders   day_name
461 2019-10-20        5125        3       3     Sunday
848 2019-07-11        3524       25      99   Thursday
931 2018-12-14        2654       11       1     Friday
727 2019-10-20        1932       18       6     Sunday
928 2019-01-02        5371       22       4  Wednesday

In [77]:
# is weekend:

df_order["is_weekend"] = np.where(df_order["day_name"].isin(["Sunday","Saturday"]),1,0)

df_order.sample(5)

          date  product_id  city_id  orders  day_name  is_weekend
435 2018-10-20        4847       26       9  Saturday           1
175 2018-09-04        3125        1      10   Tuesday           0
764 2019-07-26        6850        1       2    Friday           0
236 2018-08-24        4576       22       3    Friday           0
741 2019-11-10        7318       25       1    Sunday           1

In [78]:

# find quarter:
df_order["quarter"] = df_order["date"].dt.quarter

df_order.sample(5)

          date  product_id  city_id  orders   day_name  is_weekend  quarter
328 2019-11-20        7467       23       2  Wednesday           0        4
758 2019-01-03        2306       14       2   Thursday           0        1
594 2019-04-14         547        4      86     Sunday           1        2
622 2018-09-21        3234       25       2     Friday           0        3
28  2019-04-20        5501       16       1   Saturday           1        2

In [89]:
# find semester:

df_order["semester"] = np.where(df_order["quarter"].isin([1,2]),1,2)

df_order.sample(5)

,date,product_id,city_id,orders,day_name,is_weekend,quarter,semester
181,2019-04-12,1744,13,2,Friday,0,2,1
289,2019-11-21,483,14,3,Thursday,0,4,2
714,2019-08-07,4659,1,1,Wednesday,0,3,2
629,2019-01-15,7138,28,1,Tuesday,0,1,1
360,2019-03-23,435,7,2,Saturday,1,1,1

<br>
<br>

# Date time module: 

<br>
<br>

In [90]:
today = datetime.datetime.today() 
today

datetime.datetime(2024, 7, 5, 10, 19, 57, 300016)

In [91]:


# time and date difference 

today - df_order['date']

0     1669 days 10:19:57.300016
1     2151 days 10:19:57.300016
2     2082 days 10:19:57.300016
3     1784 days 10:19:57.300016
4     2007 days 10:19:57.300016
                 ...
995   2097 days 10:19:57.300016
996   2038 days 10:19:57.300016
997   1886 days 10:19:57.300016
998   1951 days 10:19:57.300016
999   1725 days 10:19:57.300016
Name: date, Length: 1000, dtype: timedelta64[ns]

In [98]:

# date different

(today - df_order['date']).dt.days

0      1669
1      2151
2      2082
3      1784
4      2007
       ...
995    2097
996    2038
997    1886
998    1951
999    1725
Name: date, Length: 1000, dtype: int64

<br>
<br>
<br>

# Now, discuss about time: 

<br>
<br>

In [99]:
df_message.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [107]:
df_message["date"] = pd.to_datetime(df_message["date"])

df_message.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [109]:
df_message["hour"] = df_message["date"].dt.hour
df_message["minute"] = df_message["date"].dt.minute
df_message["second"] = df_message["date"].dt.second

df_message["time"] = df_message["date"].dt.time

df_message.sample(5)

,date,msg,hour,minute,second,time
388,2014-08-01 22:32:00,я все нормально мне дали 3 6 уже с ув. Ухо.,22,32,0,22:32:00
659,2012-02-14 00:30:00,Девушка 20 полная но симпатичная познакомится ...,0,30,0,00:30:00
722,2014-07-04 00:34:00,Позн с Дев для общения жел без тараканов мне 2...,0,34,0,00:34:00
998,2012-06-21 23:34:00,7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14,23,34,0,23:34:00
368,2012-08-28 23:25:00,ОЧ ОДИНОКИЙ П24г ИЩУ ДЕВ 28-36Л ДЛЯ ОБЩЕНИЯ И ...,23,25,0,23:25:00

In [110]:
today - df_message["date"] # time difference

0     3855 days 09:29:57.300016
1     3719 days 10:39:57.300016
2     4205 days 09:58:57.300016
3     3507 days 09:48:57.300016
4     3904 days 11:08:57.300016
                 ...
995   4494 days 09:29:57.300016
996   3815 days 11:05:57.300016
997   4280 days 10:42:57.300016
998   4396 days 10:45:57.300016
999   3668 days 10:54:57.300016
Name: date, Length: 1000, dtype: timedelta64[ns]

In [113]:
# in seconds:

(today-df_message["date"])/np.timedelta64(1,'s')

0      3.331062e+08
1      3.213600e+08
2      3.633479e+08
3      3.030401e+08
4      3.373457e+08
           ...
995    3.883158e+08
996    3.296560e+08
997    3.698306e+08
998    3.798532e+08
999    3.169545e+08
Name: date, Length: 1000, dtype: float64

In [114]:
# in minutes:

(today-df_message["date"])/np.timedelta64(1,'m')

0      5551769.955
1      5355999.955
2      6055798.955
3      5050668.955
4      5622428.955
          ...
995    6471929.955
996    5494265.955
997    6163842.955
998    6330885.955
999    5282574.955
Name: date, Length: 1000, dtype: float64

In [115]:

# in hour: 

(today-df_message["date"])/np.timedelta64(1,'h')

0       92529.499250
1       89266.665917
2      100929.982583
3       84177.815917
4       93707.149250
           ...
995    107865.499250
996     91571.099250
997    102730.715917
998    105514.765917
999     88042.915917
Name: date, Length: 1000, dtype: float64